{
    "title": "Haunted Roots",
    "subtitle": "The Forgotten Memories of Blackwood Manor",
    "poster": ".//images/haunted-roots.jpg",
    "chapters": [
      {
        "id": 1,
        "title": "Willow Holler",
        "content": "Willow Holler is a once-thriving Appalachian town frozen in time, its abandoned streets brimming with an eerie blend of nostalgia and mystery. Nestled deep in a secluded valley surrounded by towering hills and dense forests, the town exudes both natural beauty and an unsettling quietness.",
        "hiddenMessages": [
          {
            "id": "hidden-1",
            "trigger": "mystery",
            "message": "The windows aren't just dark, they're watching you.",
            "found": false
          },
          {
            "id": "hidden-2",
            "trigger": "exudes",
            "message": "The key belonged to your grandfather. He never wanted you to have it.",
            "found": false
          }
        ]
      },
      {
        "id": 2,
        "title": "Main Street",
        "content": "The heart of Willow Holler is a cobblestone street lined with dilapidated buildings. Once vibrant shops like Millie’s General Store and Holler's Café stand silent, their weathered signs swaying in the occasional gust of wind. Glass windows are foggy, hiding shelves still stocked with dust-covered goods. The wooden sidewalks creak underfoot, as though holding the memories of countless footsteps from a bygone era.",
        "hiddenMessages": [
          {
            "id": "hidden-3",
            "trigger": "Willow Holler",
            "message": "The whispers are the voices of those who died here. They know your true purpose.",
            "found": false
          },
          {
            "id": "hidden-4",
            "trigger": "Millie’s",
            "message": "The moon hasn't shone on this property in fifty years. What you're seeing isn't moonlight.",
            "found": false
          },
          {
            "id": "hidden-5",
            "trigger": "dust-covered",
            "message": "Behind the wallpaper are carved symbols. Protection spells that are failing.",
            "found": false
          }
        ]
      },
      {
        "id": 3,
        "title": "The Town Square",
        "content": "The centerpiece of the town, the square is anchored by an old, ornate fountain carved with angelic figures, now dry and covered in moss. Overgrown rose bushes and ivy spill over cobblestones, reclaiming the space. At night, the square is illuminated by the faint, ghostly glow of spirits who linger here, their whispers carried by the wind.",
        "hiddenMessages": [
          {
            "id": "hidden-6",
            "trigger": "figures",
            "message": "They weren't erased. They were removed from existence.",
            "found": false
          },
          {
            "id": "hidden-7",
            "trigger": "rose",
            "message": "The symbols mark those who tried to escape. None succeeded.",
            "found": false
          },
          {
            "id": "hidden-8",
            "trigger": "ghostly",
            "message": "The footsteps belong to your great-aunt Eliza. She's been searching for someone to pass her burden to.",
            "found": false
          }
        ]
      },
      {
        "id": 4,
        "title": "The Cemetery",
        "content": "Perched on a hillside overlooking the town, the cemetery is filled with crooked headstones, some so old the engravings have eroded. The wrought-iron gate creaks as it opens, and a narrow dirt path leads visitors through rows of graves marked with symbols from the 19th century. Tall willow trees droop like sentinels, their long branches swaying gently, adding an air of reverence.",
        "hiddenMessages": [
          {
            "id": "hidden-9",
            "trigger": "cemetery",
            "message": "...",
            "found": false
          },
          {
            "id": "hidden-10",
            "trigger": "wrought-iron",
            "message": "......",
            "found": false
          },
          {
            "id": "hidden-11",
            "trigger": "sentinels",
            "message": ".........",
            "found": false
          },
          {
            "id": "hidden-12",
            "trigger": "reverence",
            "message": ".............",
            "found": false
          }
        ]
      }
    ]
  }