{
    "title": "Haunted Roots",
    "subtitle": "The Forgotten Memories of Blackwood Manor",
    "poster": ".//images/haunted-roots.png",
    "chapters": [
      {
        "id": 1,
        "title": "The Arrival",
        "content": "The old iron gates of Blackwood Manor creaked open as I approached, almost as if welcoming me home. But this wasn't my home—not yet. The ancient house stood silhouetted against the twilight sky, its windows dark and unwelcoming. As I walked up the overgrown path, the weight of generations seemed to press down upon me. I was the last of the Blackwood line, and now, the estate was mine.\n\nThe key felt unnaturally cold in my hand as I inserted it into the front door's lock. Something about this place felt wrong, yet strangely familiar. Had I been here before? In dreams, perhaps...",
        "hiddenMessages": [
          {
            "id": "hidden-1",
            "trigger": "windows",
            "message": "The windows aren't just dark, they're watching you.",
            "found": false
          },
          {
            "id": "hidden-2",
            "trigger": "key",
            "message": "The key belonged to your grandfather. He never wanted you to have it.",
            "found": false
          }
        ]
      },
      {
        "id": 2,
        "title": "Whispers in the Walls",
        "content": "My first night at Blackwood Manor was restless. The old house seemed to breathe around me, its ancient timbers expanding and contracting with the darkness. Just as I was drifting to sleep, I heard it—a whisper, so faint I might have imagined it. A name, perhaps? My name?\n\nI sat up in bed, the sheets pooling around me. The bedroom was still, moonlight casting long shadows across the antique furniture. But the whispers continued, seemingly coming from within the walls themselves. I pressed my ear against the faded wallpaper, its pattern reminiscent of twisted roots or perhaps veins. The whispers grew clearer—they were calling me deeper into the house.",
        "hiddenMessages": [
          {
            "id": "hidden-3",
            "trigger": "whisper",
            "message": "The whispers are the voices of those who died here. They know your true purpose.",
            "found": false
          },
          {
            "id": "hidden-4",
            "trigger": "moonlight",
            "message": "The moon hasn't shone on this property in fifty years. What you're seeing isn't moonlight.",
            "found": false
          },
          {
            "id": "hidden-5",
            "trigger": "wallpaper",
            "message": "Behind the wallpaper are carved symbols. Protection spells that are failing.",
            "found": false
          }
        ]
      },
      {
        "id": 3,
        "title": "The Family Tree",
        "content": "In the manor's vast library, I discovered a leather-bound book, its pages yellowed with age. Within it lay the Blackwood family tree, branches extending back centuries. My finger traced the lines to my name at the bottom—the last name on the page.\n\nBut something was wrong. There were gaps in the tree, entire branches that appeared to have been carefully erased. And beside some names were curious symbols I didn't recognize. As I studied the markings, a chill ran down my spine. The temperature in the room seemed to drop suddenly, and I could have sworn I heard footsteps behind me.\n\nWhen I turned around, I was alone. But the door to the library, which I was certain I had left open, was now firmly shut.",
        "hiddenMessages": [
          {
            "id": "hidden-6",
            "trigger": "erased",
            "message": "They weren't erased. They were removed from existence.",
            "found": false
          },
          {
            "id": "hidden-7",
            "trigger": "symbols",
            "message": "The symbols mark those who tried to escape. None succeeded.",
            "found": false
          },
          {
            "id": "hidden-8",
            "trigger": "footsteps",
            "message": "The footsteps belong to your great-aunt Eliza. She's been searching for someone to pass her burden to.",
            "found": false
          }
        ]
      }
    ]
  }